var all_questions = {
    "inductive_towers": {
        "question_1": {
            "question_wording": "Вывод, который можно сделать по данной схеме:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Надо ставить на черное, если шарик 5 раз выпал на красное. Это поможет чаще выигрывать, чем проигрывать."
                },
                {
                    "let": "b",
                    "text": "Надо ставить на черное, если шарик 6 раз выпал на красное. Это поможет чаще выигрывать, чем проигрывать."
                },
                {
                    "let": "c",
                    "text": "Ставка на другой цвет после 5 попаданий не позволит выигрывать чаще, чем проигрывать."
                }
            ]
        },
        "question_2": {
            "question_wording": "Подходит ли данный инструмент для Мардж:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Да"
                },
                {
                    "let": "b",
                    "text": "Нет"
                },
                {
                    "let": "c",
                    "text": "Иногда"
                }
            ]
        },
        "question_3": {
            "question_wording": "Оценив условия мысленного эксперимента и визуального организатора, какой вывод можно сделать:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "У Мардж все отлично с логикой"
                },
                {
                    "let": "b",
                    "text": "Ошибка Мардж связана с мышлением и не вызвана каким-то сбоем в реальном мире"
                },
                {
                    "let": "c",
                    "text": "Мардж посчитала реальным то, что не было подтверждено ее наблюдениями"
                },
                {
                    "let": "d",
                    "text": "Мардж будет очень богатой очень скоро"
                },
                {
                    "let": "e",
                    "text": "Мардж – плохой экспериментатор"
                }
            ]
        }
    },
    "charts": {
        "question_1": {
            "question_wording": "Вывод, который можно сделать по данной схеме:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Надо ставить на черное, если шарик 5 раз выпал на красное. Это поможет чаще выигрывать, чем проигрывать."
                },
                {
                    "let": "b",
                    "text": "Надо ставить на черное, если шарик 6 раз выпал на красное. Это поможет чаще выигрывать, чем проигрывать."
                },
                {
                    "let": "c",
                    "text": "Ставка на другой цвет после 5 попаданий не позволит выигрывать чаще, чем проигрывать."
                }
            ]
        },
        "question_2": {
            "question_wording": "Подходит ли данный инструмент для Мардж:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Да"
                },
                {
                    "let": "b",
                    "text": "Нет"
                },
                {
                    "let": "c",
                    "text": "Иногда"
                }
            ]
        },
        "question_3": {
            "question_wording": "Оценив условия мысленного эксперимента и визуального организатора, какой вывод можно сделать:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "У Мардж все отлично с логикой"
                },
                {
                    "let": "b",
                    "text": "Мардж посчитала реальным то, что не было подтверждено ее наблюдениями"
                },
                {
                    "let": "c",
                    "text": "Мардж будет очень богатой очень скоро"
                },
                {
                    "let": "d",
                    "text": "Мардж – плохой экспериментатор"
                }
            ]
        }
    },
    "drawings_and_matrixes": {
        "question_1": {
            "question_wording": "Использовала ли Мардж данную формулу?",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Да"
                },
                {
                    "let": "b",
                    "text": "Нет"
                },
                {
                    "let": "c",
                    "text": "Иногда"
                }
            ]
        },
        "question_2": {
            "question_wording": "Достаточно ли данной формулы для построения матрицы распределения вероятности?",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Да"
                },
                {
                    "let": "b",
                    "text": "Нет"
                },
                {
                    "let": "c",
                    "text": "Иногда"
                }
            ]
        },
        "question_3": {
            "question_wording": "Какой величины не достаточно для построения матрицы и вычисления точной вероятности возможного выигрыша?",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Плотности перехода"
                },
                {
                    "let": "b",
                    "text": "Рассеянности перехода"
                },
                {
                    "let": "c",
                    "text": "Продолжительности наблюдения"
                }
            ]
        }
    },
    "pie_chart": {
        "question_1": {
            "question_wording": "Вывод, который можно сделать по данной схеме:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Надо ставить на черное, если шарик 5 раз выпал на красное. Это поможет чаще выигрывать, чем проигрывать."
                },
                {
                    "let": "b",
                    "text": "Надо ставить на черное, если шарик 6 раз выпал на красное. Это поможет чаще выигрывать, чем проигрывать."
                },
                {
                    "let": "c",
                    "text": "Ставка на другой цвет после 5 попаданий не позволит выигрывать чаще, чем проигрывать."
                }
            ]
        },
        "question_2": {
            "question_wording": "Подходит ли данный инструмент для Мардж:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Да, при длительном наблюдении"
                },
                {
                    "let": "b",
                    "text": "Да, всегда"
                },
                {
                    "let": "c",
                    "text": "Нет"
                },
                {
                    "let": "d",
                    "text": "Иногда"
                }
            ]
        },
        "question_3": {
            "question_wording": "Оценив условия мысленного эксперимента и визуального организатора, какой вывод можно сделать:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "У Мардж все отлично с логикой"
                },
                {
                    "let": "b",
                    "text": "Мардж посчитала реальным то, что не было подтверждено ее наблюдениями"
                },
                {
                    "let": "c",
                    "text": "Мардж будет очень богатой очень скоро"
                },
                {
                    "let": "d",
                    "text": "Мардж – плохой экспериментатор"
                }
            ]
        }
    },
    "pie_charts": {
        "question_1": {
            "question_wording": "Вывод, который можно сделать по данной схеме:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Надо ставить на черное, если шарик 5 раз выпал на красное. Это поможет чаще выигрывать, чем проигрывать."
                },
                {
                    "let": "b",
                    "text": "Надо ставить на черное, если шарик 6 раз выпал на красное. Это поможет чаще выигрывать, чем проигрывать."
                },
                {
                    "let": "c",
                    "text": "Ставка на другой цвет после 5 попаданий не позволит выигрывать чаще, чем проигрывать."
                }
            ]
        },
        "question_2": {
            "question_wording": "Подходит ли данный инструмент для Мардж:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Да, при длительном наблюдении"
                },
                {
                    "let": "b",
                    "text": "Да, всегда"
                },
                {
                    "let": "c",
                    "text": "Нет"
                },
                {
                    "let": "d",
                    "text": "Иногда"
                }
            ]
        },
        "question_3": {
            "question_wording": "Оценив условия мысленного эксперимента и визуального организатора, какой вывод можно сделать:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "У Мардж все отлично с логикой"
                },
                {
                    "let": "b",
                    "text": "Мардж посчитала реальным то, что не было подтверждено ее наблюдениями"
                },
                {
                    "let": "c",
                    "text": "Мардж будет очень богатой очень скоро"
                },
                {
                    "let": "d",
                    "text": "Мардж – плохой экспериментатор"
                }
            ]
        }
    },
    "causal_card_chains": {
        "question_1": {
            "question_wording": "Вывод, который можно сделать по данной схеме:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Надо ставить на черное, если шарик 5 раз выпал на красное. Это поможет чаще выигрывать, чем проигрывать."
                },
                {
                    "let": "b",
                    "text": "Надо ставить на черное, если шарик 6 раз выпал на красное. Это поможет чаще выигрывать, чем проигрывать."
                },
                {
                    "let": "c",
                    "text": "Мардж не нужно ходить в казино. Казино выигрывает чаще."
                }
            ]
        },
        "question_2": {
            "question_wording": "Подходит ли данный инструмент для Мардж:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Да, при правильной оценки вероятности"
                },
                {
                    "let": "b",
                    "text": "Да, всегда"
                },
                {
                    "let": "c",
                    "text": "Нет"
                },
                {
                    "let": "d",
                    "text": "Иногда"
                }
            ]
        },
        "question_3": {
            "question_wording": "Оценив условия мысленного эксперимента и визуального организатора, какой вывод можно сделать:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "У Мардж все отлично с логикой"
                },
                {
                    "let": "b",
                    "text": "Мардж посчитала реальным то, что не было подтверждено ее наблюдениями"
                },
                {
                    "let": "c",
                    "text": "Мардж будет очень богатой очень скоро"
                },
                {
                    "let": "d",
                    "text": "Мардж – плохой экспериментатор"
                }
            ]
        }
    },
    "current_cards": {
        "question_1": {
            "question_wording": "Вывод, который можно сделать по данной схеме:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Надо ставить на черное, если шарик 5 раз выпал на красное. Это поможет чаще выигрывать, чем проигрывать."
                },
                {
                    "let": "b",
                    "text": "Надо ставить на черное, если шарик 6 раз выпал на красное. Это поможет чаще выигрывать, чем проигрывать."
                },
                {
                    "let": "c",
                    "text": "Мардж пытается снизить вероятность проигрыша."
                }
            ]
        },
        "question_2": {
            "question_wording": "Подходит ли данный инструмент для Мардж:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "Да, при правильной оценки вероятности"
                },
                {
                    "let": "b",
                    "text": "Да, всегда"
                },
                {
                    "let": "c",
                    "text": "Нет"
                },
                {
                    "let": "d",
                    "text": "Иногда"
                }
            ]
        },
        "question_3": {
            "question_wording": "Оценив условия мысленного эксперимента и визуального организатора, какой вывод можно сделать:",
            "answer_choices": [
                {
                    "let": "a",
                    "text": "У Мардж все отлично с логикой"
                },
                {
                    "let": "b",
                    "text": "Мардж посчитала реальным то, что не было подтверждено ее наблюдениями"
                },
                {
                    "let": "c",
                    "text": "Мардж будет очень богатой очень скоро"
                },
                {
                    "let": "d",
                    "text": "Мардж – плохой экспериментатор"
                }
            ]
        }
    }
}