
let people = {
    man_1: {
        id: "man_1",
        title: "Иван",
        title_1: "Ивана",
        title_2: "Ивану",
        answers:{
            "question_1": "Безвыходных ситуаций не бывает, я всегда ищу новые возможности - как среди своих коллег, так и во внешней среде. Всегда имею в запасе план Б. Если не подействовал план А, перехожу к плану Б, если он не рааботает - к плану С и т.д. ",
            "question_2": "Это было в начале моей карьеры, я работал в новой команде, где никто не был друг другу представлен. Я потратил время на то, чтобы познакомить всех, тогда работа пошла лучше не только у меня, но и у остальных.",
            "question_3": "Да, я определнно командный игрок. Я считаю, что в команде единомышленников можно в разы быстрее придти к намеченной цели. Мне нравится координировать процесс командной работы, слушать и анализировать идеи всех участников, искать новые возможности для лучшего решения вопроса.",
            "question_4": "Скорее всего - поиск новых возможностей. Когда команда заходит в тупик и не может своими силами решить какую-то задачу, я ищу разнообразные способы решения во внешней среде.",
            "question_5": "Это случайно достаточно редко - я всегда стараюсь внимательно слушать оппонента,  находить что-то общее между нами, понимать и принимать его видение. Я прекрасно понимаю, что все люди разные, поэтому спокойно отношусь к расхождениям. Считаю, что диалог и обсуждение - лучший способ все обсудить и расставить точки на i. ",
            "question_6": "Считаю, что любая критика - это хорошо, ведь благодаря этом можно исправить реальные пробелы. Но для этого она должна быть коструктивной. Если получаю в свой адрес только обвинения, не спешу с выводами, а выясняю - что именно имелл ввиду человек. ",
            "question_7": "В таких ситуациях я начинаю работать быстрее! У меня появляется интерес, азарт, я стараюсьь выжать максимум своих возможностей для качественно и быстрого решения.",
            "question_8": "Я советовался с коллегами или друзьями, которые в этой области намного способней меня. Именно поэтому я и считаю, что командная работа - лучше индивидуальной. "
        }
    },
    man_2: {
        id: "man_2",
        title: "Светлана",
        title_1: "Светланы",
        title_2: "Светлане",
        answers:{
            "question_1": "Безвыходных ситуаций не бывает, я всегда ищу новые возможности, а не оправдания. Я концентрируюсь на вопросах - что еще можно сделать, что я упускаю? Так собираю разные варианты решений и консультируюсь с вышестоящим руководством.",
            "question_2": "Я всегда в проектах отвечаю за финансовую часть. Не могу сказать, что у меня есть опыт совершенно неудачных проектов. Обычно все удавалось решить самостоятельно или с поддержкой руководства.",
            "question_3": "Мне одинаково комфортно работать и в команде, и в самостоятельно. Главное, чтобы в команде были адекватные люди, которые готовы работать, а не филонить и искать оправдания.",
            "question_4": "Зарплата. Т.к. финансовые потоки контролирую я, то зарплата всех зависит от меня. Поэтому я всегда скрупулезно слежу за сроками - чтобы все было вовремя. И остальныжх к этому приучаю.",
            "question_5": "Я прекрасно понимаю, что все люди разные, и всегда есть несколько точек зрения на одну и ту же ситуацию.  Диалог - это всегда хорошо. Главное, чтобы у всех были готовы аргументированные позиции, оразъяснения и доказательства.",
            "question_6": "Спокойно отношусь к критике, если она аргументирована, основана на реальных фактах. Если этого нет, всегда справшиваю - что конкретно и почему неустраивает.",
            "question_7": "Я уже привыкла работать в сжатых сроках. Если нужно - готова до ночи сидеть на работе для того, чтобы все было сделано вовремя.",
            "question_8": "Не было такого. Я справлялась с любыми задачами - либо самостоятельно, либо с поддержкой руководства."
        }
    },
    man_3: {
        id: "man_3",
        title: "Дарья",
        title_1: "Дарьи",
        title_2: "Дарье",
        answers:{
            "question_1": "Всегда беру ответственность на себя, не люблю обращаться к кому-либо за помощью. Всегда ищу решения ситуации, беру инициативу в свои руки, выхожу за рамки своей зоны ответственности без указания начальства.",
            "question_2": "Это был неприятный опыт работы в команде. Кто-то чего-то не знал, кто-то опаздывал. Мне пришлось все доделывать самой. Теперь я не доверю всем этим командным заданиям, стараюсь избегать совместной ответственности.",
            "question_3": "Мне трудно работать в команде. Я не люблю, когда рещультат зависит от нескольких человек. Мне гораздо спокойнее работать в одиночестве, когда я сама несу ответственность за результат и ни от кого не завишу.",
            "question_4": "Работа с документами. Я всегда знаю, как правльно составить тот или иной документ. В этом у меня всегда порядок.",
            "question_5": "Это случайно достаточно редко. Я прекрасно понимаю, что все люди разные, поэтому спокойно отношусь к расхождениям. Я всегда стараюсь внимательно слушать оппонента,  находить что-то общее между нами, понимать и принимать его видение. Стараюсь спокойно и аргументированно разъяснять свою позицию. ",
            "question_6": "Я достаточно эмоциональна и если критика меня обижает, то могу расстроиться. Но потом я всегда анализирую - что именно мне сказали и каким образом мне это поможет в работе. ",
            "question_7": "В условиях дедлайна всегда работаю продуктивнее. Это меня еще больше дисциплинирует, сильнее сосредотачивает на результате.",
            "question_8": "Разумеется, бывали. В этом случае я никогда не скрываю и прямо говорю, где и почему у меня возникнут трудности. Все руководители, которые у меня были, всегда были готовы помочь."
        }
    },
    man_4: {
        id: "man_4",
        title: "Михаил",
        title_1: "Михаила",
        title_2: "Михаилу",
        answers:{
            "question_1": "Безвыходных ситуаций не бывает, главное - четкая цель. Я всегда ищу новые возможности, а не оправдания. Так как работаю с документами, то всегда пополняю свои знанию, много читаю. И для решения сложных задач готов погружаться в литературу в головой. Так собираю разные варианты решений и консультируюсь с вышестоящим руководством.",
            "question_2": "Меня считают критиком в любой работе, т.к. мне важно, чтобы все идеи и действия соответствовали соглашениям, положениях, должностным инструкциям и пр. Многие считают, что я вставляю палки в колеса, но без этого нельзя. Иначе мы рискуем нарушить закон.",
            "question_3": "Мне одинаково комфортно работать и в команде, и в самостоятельно. Вообще больше доверяю документам, чем людям. Все идеи коллег анализирую, проверяю их на реалистичность и следование закону. ",
            "question_4": "Педантичность в работе с документами, составлении соглашений, договоров и пр. Я всегда досконально изучаю любую документацию и готов нести ответственность за эту часть работы.",
            "question_5": "Я понимаю, что достаточно молчалив и зануден, поэтотму не всегда приятен в общении. Однако я всегда готов выслушать другого, главное - чтобы его позиция была аргументирована. ",
            "question_6": "Спокойно отношусь к критике, это нормальный работчий процесс. Главное, чтобы критика касалась не моей личности, а моей работы.",
            "question_7": "Вообще мне это дается не просто, я чувствую себя некомфортно в сжатых сроках. Поэтому всегда заранее планирую детельность и прошу коллег по команде придерживаться этому плану. Готов контролировать этот процесс.",
            "question_8": "Не было такого. Обычно я всегда справляюсь с трудностями самостоятельно, изучая что-то новое, восполняя пробелы в знаниях."
        }
    },
    man_5: {
        id: "man_5",
        title: "Татьяна",
        title_1: "Татьяны",
        title_2: "Татьяне",
        answers: {
            "question_1": "Безвыходных ситуаций не бывает! Я концентрируюсь на вопросах - что еще можно сделать, что я упускаю? А еще мне очень повезло - мои коллеги очень умные, открытые и всегда готовы помочь. ",
            "question_2": "Я всегда с легкостью обращаюсь за помощью к коллегам или начальству, если понимаю, что несправляюсь с задачей. ",
            "question_3": "Я определенно командный человек. Очень люблю командную работу. Мне нравится ощущение целостности, сплоченности, своместной работы. Когда все движутся к одному результату - это какя-то магическая сила. Обычно я всегда сразу понимаю, кто с какой задачей может справиться.",
            "question_4": "Поддерживаю коллег, помогаю решать конфикты и разногласия. ",
            "question_5": "Я очень внимательный слушатель, понимающий собеседник. Я очень чувствительна к переживаниям и эмоциям других людей и понимаю, с чем это связано. Поэтому в конфликтах всегда больше слушаю, чем говорю. И стараюсь сначала успокоить и поддержать оппонента, а потом уже решать вопрос. ",
            "question_6": "Мне, как и любому человеку, не приятны обвинения в мой адрес. Но если критика носит характер объективной обратной связи, в которой отмечены и положительные стороны, и недочеты, то отношусь к этому положительно. Такая обратная связь помогает мне вырасти и стать лучше. ",
            "question_7": "Не скажу, что мне кофортна такая работа. Все-таки я уже не в том возрасте, чтобы куда-то спешить, торопиться. Это затсавляет меня нервничать, переживать. Сконцентрироваться в таком состоянии практически невозможно.  ",
            "question_8": "Я всегда с легкостью обращаюсь за помощью к коллегам или начальству, если понимаю, что несправляюсь с задачей. Обычно все готовы мне помочь. "
        }
    },
    man_6: {
        id: "man_6",
        title: "Олег",
        title_1: "Олега",
        title_2: "Олегу",
        answers:{
            "question_1": "Безвыходных ситуаций не бывает, я всегда ищу новые возможности - как среди своих коллег, так и во внешней среде. Всегда имею в запасе план Б. Если не подействовал план А, перехожу к плану Б, если он не рааботает - к плану С и т.д. ",
            "question_2": "Я не очень пунктуальный человек, из-за этого часто подвожу команду. Мне нужен человек рядом, который будет меня контролировать, напоминать о сроках, держать в тонусе.",
            "question_3": "Да, определенно. Я вообще считаю себя очень важным членом любого коллектива, т.к. мне ужается найти такие слова, которые замотивируют команду, подтолкнут ее к действиям. ",
            "question_4": "Ищу ресурсы и возможности за пределами команды. Могу с легкостью договориться с кем-угодно, найти инвесторов, хороших подрядчиков и пр.",
            "question_5": "Таких случаев не было. Я всегда нахожу общий язык с разными людьми. Всегда аргументировано высказываю свое мнение, слушаю позицию оппонента и стараюсь реализовать стратегию выигрыш-выиграш.",
            "question_6": "Критика в мой адрес часто касается срыва сроков. Я спокойно к этому отношусь, искренне извиняюсь, т.к. понимаю, что это действительно мой минус.",
            "question_7": "В таких ситуациях я начинаю работать быстрее! У меня появляется интерес, азарт, я стараюсьь выжать максимум своих возможностей для качественно и быстрого решения.",
            "question_8": "Чувствую в таком случае себя спокойно, уверен, что безвыходных ситуаций не бывает. Я всегда ищу новые возможности - как среди своих коллег, так и во внешней среде. "
        }
    },
    man_7: {
        id: "man_7",
        title: "Константин",
        title_1: "Константина",
        title_2: "Константину",
        answers:{
            "question_1": "Я верю в себя, свои силы, знания и умения. Доверяю себе больше, чем окружающим. И это мне всегда помогало в безвыходных (на первый взгляд) ситуациях. ",
            "question_2": "Обычно я выступаю в роли креативщика, идейщика - это мне дается легко. Но мои идеи часто подвергаются сомнению, это меня разбалансирует. Обычно я замыкаюсь, ничео не говорю и не иду на конфликт, но продолжать работать становится не выносимо.",
            "question_3": "Не думаю, что  я командный игрок. Мне непросто общаться с коллегами, а командная работа подразумевает постоянный контакт с ними. Все-таки мне комфортнее знать свою зону ответственности и не зависеть от кого-то еще.",
            "question_4": "Креативность, идейность",
            "question_5": "Такое встреччается достаточно часто. Я не всегда понимаю людей, а они не понимают меня. Поэтому мне проще работать в одиночестве, чтобы никто не навязывал мне свои идеи.",
            "question_6": "Меня очень часто критикуют, почему то мои идеи вызывают сначала протест, а потом только все понимают их значимость. Когда меня критикуют, я замыкаюсь и не хочу вообще ни с кем ничего обсуждать.",
            "question_7": "В условиях дедлайна всегда работаю достаточно продуктивно. Это для меня вообще не проблема.",
            "question_8": "Не помню, что такие ситуации возникали. Я всегда могу самостоятельно решить все трудности.",
        }
    },
    man_8: {
        id: "man_8",
        title: "Мария",
        title_1: "Марии",
        title_2: "Марии",
        answers:{
            "question_1": "Обычно в трудных ситуациях меня выручает креативность, идейность и воображение. Мне всегда удается придумать какой-то необычный способ выхода из трудной ситуации. Поэтому я не переживаю, если сталкиваюсь с неприятностями - я знаю, что скоро вдохновение меня выручит.",
            "question_2": "Я всегда делаю все от себя зависящее для общего результата. Мне тяжело дается критика или непрошенные советы в мой адрес. Однажды эот было настолько навязчивым, что я не смогла работать в таком коллективе и просто ушла.",
            "question_3": "В целом - да, но если мои личные границы соблюдаются. Я прекрасно понимаю, что не смогу справиться со всеми задачами одна. Но люблю работать в команде, где друг друга поддерживают, а не мешают друг другу.",
            "question_4": "Генерация идей, инновационность, владение навыками веб-дизайна",
            "question_5": "Я не очень коммуникабельна и стараюсь уходить от конфликтов. Предпочитаю, чтобы со мной не спорили, а разговаривали - спокойно излагали свою мысль, но и меня тоже слушали.",
            "question_6": "Критику в свой адрес не люблю, реагирую на нее эмоционально (обижаюсь). Но если мне не только скажут, что все плохо, но и отметят какие-то положительные стороны моей работы, то воспринимаю это нормально.",
            "question_7": "В условиях дедлайна всегда работаю достаточно продуктивно. Это для меня вообще не проблема. Но если сроки будут определены для меня заранее, это повысит мою эффективность.",
            "question_8": "Нет, таких случаев не было. Обычно мне всегда хватает своих знаний, навыков, инновационности для решения поставленной задачи. В случае каки-то трудностей, знаю, что могу обратиться к коллеге - Константину. Обычно он меня очень выручает."
        }
    },
    man_9: {
        id: "man_9",
        title: "Елена",
        title_1: "Елены",
        title_2: "Елене",
        answers:{
            "question_1": "Чем труднее задачка - тем интересней! Вижу цель, не вижу препятствий.  А если мне не хватает своих знаний и навыков, я всегда могу обратиться к друзьям, коллегам, родным. ",
            "question_2": "Не вспомню такого в моей профессиональной жизни. Я очень оптимистично смотрю на вещи. И даже если у меня возникают трудности в работе, то я верю - это не зря. Просто нужно искать в этом пользу и двигаться дальше.",
            "question_3": "Да, это абсолютно точно! С любимыми коллегами в команде мне намного комортней, спокойней работается. Я стараюсь поддерживать комнадный дух, помогаю в регулировании разногласий. Легко общаюсь с клиентами, помогаю им, а они - мне.",
            "question_4": "Коллеги говорят, что я - «солнышко» и это их очень поддерживает. А еще мне легко дается организация крупных мероприятий - на этом я собаку съела! ",
            "question_5": "Я всегда очень внимательна к людям, стараюсь их выслушать, понять их, а иногда даже успокоить. Мне кажется часто именно эмоции мешают людям договариваться. Поэтому в конфликтах всегда больше слушаю, чем говорю. А когда оппонент выскажется, там сразу становится ясна ситуация и договориться становится в разы проще.",
            "question_6": "Настоящую критику воспринимаю болезненно, но такая в мой адрес приходит не часто. Обычно мои ошибки всегда аргументируют и подсказывают, как исправить. В этом случае я только благодарна такой обратной связи.",
            "question_7": "Я уже привыкла работать в сжатых сроках. Это не вызывает у меня какого-то дискомфорта. Единственное - я не люблю задерживаться на работе, у меня семья и дети. А из-за сжатых сроков иногда приходится задерживаться. ",
            "question_8": "Конечно, бывали. Я же не энциклопедия, чтобы все знать. Поэтому я люблю командную работу - я знаю, что всегда могу обратиться за помощью к коллегам и они мне с удовольствием помогут. И это взаимно. "
        }
    },
    man_10:{
        id: "man_10",
        title: "Игорь",
        title_1: "Игоря",
        title_2: "Игорю",
        answers:{
            "question_1": "У меня не было как таквых целей в жизни, думаю это еще впереди. Но я верю в себя, свои силы, знания и умения. Уверен, что у меня получится все, если я захочу.",
            "question_2": "В университете нас часто делили на всякие проектные группы. Часто мы не могли договоритсья друг с другом, придти к общему решению - каждый тянул одяело на себя. Часто я сам все делал в итоге.",
            "question_3": "Не знаю. Тот опыт, который у меня был в университете, мне не понравился. Может мне просто не везло. Я готов нести ответственность за свою часть работы, но если и другие люди готовы на это. ",
            "question_4": "Теника всегда работает. Это то, что я умею, готов нести ответственность за быстрое и качественное решение проблем в этом плане.",
            "question_5": "Обычно я не провоцирую конфликты и сам не ведусь на провокации. Мне проще промолчать и уйти от конфликта. ",
            "question_6": "Спокойно отношусь к критике, это нормальный работчий процесс. Главное, чтобы критика была обоснована.",
            "question_7": "Это мне дается легко. Богатый опыт подготовки к экзамена и сдачи проектов в университете в последний момент. Это даже больше концентрирует на результате.",
            "question_8": "Таких случаев много. Я считаю, что это нормально, я еще только учусь. В этом случае я всегд обращаюсь за помощью к преподавателям в университете или наставникам с практики - у них больше знаний и опыта."
        }
    },
}

let questions = [
    {
        id: "question_1",
        text: "Вспомните труднодостижимую цель, которую вы достигали. Как преодолели? Какой был результат?"
    },
    {
        id: "question_2",
        text: "Вспомните неудачный проект: какова была ваша роль? Что помешало достижению? Как преодолели сложности? Каков был результат?"
    },
    {
        id: "question_3",
        text: "Как вы оцените свои способности работы в команде? Считаете ли вы себя командным человеком?"
    },
    {
        id: "question_4",
        text: "Если бы я спросил вашего коллегу, что самое ценное вы сделали для команды, что бы он мне сказал?"
    },
    {
        id: "question_5",
        text: "Вспомните ситуацию, когда вам было трудно договориться с оппонентом: как вы себя вели? Удалось ли договориться?"
    },
    {
        id: "question_6",
        text: "Вспомните случай, когда вас критиковали: кто вас критиковал, как вы это восприняли?"
    },
    {
        id: "question_7",
        text: "Вспомните случай, когда вам приходилось работать в непростых условиях, в сжатых сроках или в ситуации неопределенности. Как вы себя чувствовали? Как это повлияло на процесс и результат вашего труда?"
    },
    {
        id: "question_8",
        text: "Бывали ли случаи в вашей работе, когда вам поручали задачу, которая была вам не по силам? Как вы себя вели в этом случае?"
    }
]


let vm = new Vue({
    template: `
    <div>
    <div>
    <p>У Вас есть возможность задать вопросы сотрудникам компании. Обратите внимание, что количество вопросов, на которые вы можете получить ответ,<strong> ограничено {{max_answers}}</strong> (в совокупности по всем сотрудникам).</p>

<!--        <div style="margin-bottom: 10px;">Количество доступных вопросов: {{max_answers - previous_answers.length}}</div>-->
        <div class="previous-answers">
            <div class="previous-answers-show" v-on:click="toggleShowPreviousAnswers()">Ответы на предыдущие вопросы ({{previous_answers.length}})
            <template v-if="show_previous_answers"><i class="fa fa-angle-up"></i></template>
            <template v-else><i class="fa fa-angle-down"></i></template>
            </div>
            <div v-if="show_previous_answers">
                <div v-if="previous_answers.length != 0">
                    <div v-for="(answer, answer_idx) in previous_answers" class="previous-answer">
                    <strong>{{answer_idx+1}}. </strong>Ответ <strong>{{answer.man}}</strong> на вопрос <strong>«{{answer.question}}»</strong>: «{{answer.answer}}»
                    </div>
                </div>
                <div v-else class="no-questions">
                    Сначала задайте вопросы сотрудникам
                </div>
            </div>
        </div>
        
    </div>
    <div class="people-answers">
    <div v-if="current_man == ''" >
        <p>Укажите, кому из сотрудников вы хотите задать вопрос:</p>
        <div v-for="man in Object.keys(people)" v-on:click="setCurrentMan(man)" class="man">
                {{people[man].title_2}}
        </div>
    </div>
    <div v-if="current_man != '' && current_question == ''">
        <p>Выберете вопрос, который вы хотите задать <strong>{{people[current_man].title_2}}</strong>:</p>
        <div v-for="(question, question_idx) in questions" v-on:click="setCurrentQuestion(question.id)" class="question">
                {{question_idx+1}}. {{question.text}}
        </div>
    </div>
    <div v-if="current_man != '' && current_question != ''">
        <p>Ответ <strong>{{people[current_man].title_1}}</strong>:</p>
        <div class="answer">«{{people[current_man].answers[current_question]}}»</div>
        
        <div v-if="max_answers - previous_answers.length - 1 != 0" class="next-questions-block">
             <div class="allowed-questions">Вопросов можно задать: {{max_answers - previous_answers.length - 1}}</div>
            <div class="next-questions-btn" v-on:click="resetQuestion()">Задать {{people[current_man].title_2}} другой вопрос</div>
            <div class="next-questions-btn" v-on:click="resetAll()">Спросить другого сотрудника</div>
        </div>
        <div v-else>
            <div>Задано {{max_answers}} вопросов. Больше вопросы сотрудникам задавать нельзя.</div>
        </div>
        
    </div>
    </div>
    </div>
`,
    el: '#soft_skills_case_04_03',
    data: {
        current_man: "",
        people: people,
        current_question: "",
        questions: questions,
        previous_answers: [],
        show_previous_answers: false,
        max_answers: 5,
    },
    mounted(){},
    methods: {
        setCurrentMan(id){
            this.current_man = id;
        },
        setCurrentQuestion(id){
            this.current_question = id;
        },
        toggleShowPreviousAnswers(){
            this.show_previous_answers = !this.show_previous_answers;
        },
        resetAll(){
            this.previous_answers.push(
                {
                    question: this.questions.filter(x => x.id === this.current_question)[0].text,
                    man: this.people[this.current_man].title_1,
                    answer: this.people[this.current_man].answers[this.current_question]
                }
            )
            this.current_man = "";
            this.current_question = "";
            this.show_previous_answers = false;
        },
        resetQuestion(){
            this.previous_answers.push(
                {
                    question: this.questions.filter(x => x.id === this.current_question)[0].text,
                    man: this.people[this.current_man].title_1,
                    answer: this.people[this.current_man].answers[this.current_question]
                }
            )
            this.current_question = "";
            this.show_previous_answers = false;
        }
    },
    computed: {}
});
